# Put GUI apps into /Applications (optional but common)
cask_args appdir: "/Applications"

# GUI apps
cask "visual-studio-code"
cask "zoom"
cask "postman"
cask "warp"
cask "slack"
cask "google-chrome"
cask "deepl"
cask "docker-desktop"
cask "tableplus"
cask "raycast"

# CUI apps
brew "git"
brew "stow"
brew "neovim"
brew "mise"
brew "gh"
brew "fd"
brew "fzf"
brew "jq"